# ETL Project

In [1]:
#Dependencies
import pandas as pd
from sqlalchemy import create_engine

## Extract CSVs into DataFrame

In [2]:
#Read in top250 file and view dataframe 
top250_file = "data/Top250.csv"
top250 = pd.read_csv(top250_file)
top250.head()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

In [3]:
#Read in future50 file and view dataframe 
future50_file = "data/Future50.csv"
future50 = pd.read_csv(future50_file)
future50.head()

,Rank,Restaurant,Location,Sales,YOY_Sales,Units,YOY_Units,Unit_Volume,Franchising
0,1,Evergreens,"Seattle, Wash.",24,130.5%,26,116.7%,1150,No
1,2,Clean Juice,"Charlotte, N.C.",44,121.9%,105,94.4%,560,Yes
2,3,Slapfish,"Huntington Beach, Calif.",21,81.0%,21,90.9%,1370,Yes
3,4,Clean Eatz,"Wilmington, N.C.",25,79.7%,46,58.6%,685,Yes
4,5,Pokeworks,"Irvine, Calif.",49,77.1%,50,56.3%,1210,Yes

In [4]:
#Read in Independence100 file and view dataframe 
ind100_file = "data/Independence100.csv"
ind100 = pd.read_csv(ind100_file)
ind100.head()

,Rank,Restaurant,Sales,Average Check,City,State,Meals Served
0,1,Carmine's (Times Square),39080335.0,40,New York,N.Y.,469803.0
1,2,The Boathouse Orlando,35218364.0,43,Orlando,Fla.,820819.0
2,3,Old Ebbitt Grill,29104017.0,33,Washington,D.C.,892830.0
3,4,LAVO Italian Restaurant & Nightclub,26916180.0,90,New York,N.Y.,198500.0
4,5,Bryant Park Grill & Cafe,26900000.0,62,New York,N.Y.,403000.0

## Transform DataFrames

In [5]:
#Rename sales columns in future50
future50 = future50.rename(columns={"Sales":"Sales (in millions)"})
future50.head()

,Rank,Restaurant,Location,Sales (in millions),YOY_Sales,Units,YOY_Units,Unit_Volume,Franchising
0,1,Evergreens,"Seattle, Wash.",24,130.5%,26,116.7%,1150,No
1,2,Clean Juice,"Charlotte, N.C.",44,121.9%,105,94.4%,560,Yes
2,3,Slapfish,"Huntington Beach, Calif.",21,81.0%,21,90.9%,1370,Yes
3,4,Clean Eatz,"Wilmington, N.C.",25,79.7%,46,58.6%,685,Yes
4,5,Pokeworks,"Irvine, Calif.",49,77.1%,50,56.3%,1210,Yes

In [6]:
#Rename sales columns in top250
top250 = top250.rename(columns={"Sales":"Sales (in millions)"})
top250.head()

,Rank,Restaurant,Content,Sales (in millions),YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

In [7]:
#Make the Sales units match across tables
sales_mils = ind100["Sales"]/1000000
ind100["Sales"] = sales_mils
ind100 = ind100.rename(columns={"Sales":"Sales (in millions)"})
ind100.head()

,Rank,Restaurant,Sales (in millions),Average Check,City,State,Meals Served
0,1,Carmine's (Times Square),39.080335,40,New York,N.Y.,469803.0
1,2,The Boathouse Orlando,35.218364,43,Orlando,Fla.,820819.0
2,3,Old Ebbitt Grill,29.104017,33,Washington,D.C.,892830.0
3,4,LAVO Italian Restaurant & Nightclub,26.916180,90,New York,N.Y.,198500.0
4,5,Bryant Park Grill & Cafe,26.900000,62,New York,N.Y.,403000.0

In [ ]:
#Join Future50 and Ind100 on location

#First, split Future50 into cities and states column

#Join DFs on cities

In [ ]:
#Aggregate Ind100 by summing (sales or meals) to find overall top

#Grouby Restaurant, summing by (sales or meals)

#Set rank to index

#Reset index to show new rank

## Load DataFrames into Database

In [ ]:
# Create Database Connection
connection_string = "postgres:postgres@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{connection_string}')

In [ ]:
# Confirm tables
engine.table_names()

In [ ]:
# Add dataframes to sql (use new ones from transformations)
# dataframe.to_sql(name='premise', con=engine, if_exists='append', index=True)